Revit 2026 API

# IDataConversionMonitorProcessMessage Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
bool ProcessMessage(
	DataExchangeMessageId messageId,
	DataExchangeMessageSeverity messageSeverity,
	IList<string> entityIds
)
```
```vb
Function ProcessMessage (
	messageId As DataExchangeMessageId,
	messageSeverity As DataExchangeMessageSeverity,
	entityIds As IList(Of String)
) As Boolean
```
```cpp
bool ProcessMessage(
	DataExchangeMessageId messageId,
	DataExchangeMessageSeverity messageSeverity,
	IList<String^>^ entityIds
)
```
```fsharp
abstract ProcessMessage :
        messageId : DataExchangeMessageId *
        messageSeverity : DataExchangeMessageSeverity *
        entityIds : IList<string> -> bool
```

#### Parameters

messageId DataExchangeMessageId

messageSeverity DataExchangeMessageSeverity

entityIds IListString

#### Return Value

Boolean

#### Reference

IDataConversionMonitor Interface

Autodesk.Revit.DB Namespace